Revit 2026 API

# MetalMetalFinish Property

---

The property labeled "Finish" from the "Metal" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string MetalFinish { get; }
```
```vb
Public Shared ReadOnly Property MetalFinish As String
	Get
```
```cpp
public:
static property String^ MetalFinish {
	String^ get ();
}
```
```fsharp
static member MetalFinish : string with get
```

#### Property Value

String

This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MetalFinishType".

#### Reference

Metal Class

Autodesk.Revit.DB.Visual Namespace